src/Catalogs/ХозяйствующиеСубъектыВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХозяйствующиеСубъектыВЕТИС</Name>
			<Comment>Хозяйствующие субъекты ВетИС</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип субъекта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Comment>Основной государственный регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Подотчетное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХраненияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияГрузаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлагополучиеМестности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БлагополучиеМестностиВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьГаситьВСДБезВСЭ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапасСрокаГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предприятия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойОтдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GLN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьНули</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменятьПрефикс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХозяйствующиеСубъектыВЕТИС/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Хозяйствующие субъекты ВЕТИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьОрганизациюИПодразделение(ХозяйствующийСубъект, Предприятие) Экспорт
	
	ИНН = ХозяйствующийСубъект.ИНН;
	КПП = ХозяйствующийСубъект.КПП;
	
	Результат = Новый Структура;
	Результат.Вставить("Организация",   Неопределено);
	Результат.Вставить("Подразделение", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложеннаяТаблица.Организация КАК Организация,
	|	ВложеннаяТаблица.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ВложеннаяТаблица.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		МеркурийПредприятия.ОсновнойОтдел.Организация КАК Организация,
	|		МеркурийПредприятия.ОсновнойОтдел КАК ПодразделениеКомпании,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК МеркурийПредприятия
	|	ГДЕ
	|		МеркурийПредприятия.Ссылка = &ХозяйствующийСубъект И 
	|		МеркурийПредприятия.Предприятие = &Предприятие И 
	|		(НЕ МеркурийПредприятия.ОсновнойОтдел = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПодразделенияКомпании.Организация КАК Организация,
	|		ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании,
	|		2 КАК Приоритет
	|	ИЗ
	|		Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|	ГДЕ
	|		ПодразделенияКомпании.Организация.ИНН = &ИНН И 
	|		ПодразделенияКомпании.КПП = &КПП
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		Организации.Ссылка,
	|		МеркурийПредприятия.ОсновнойОтдел,
	|		3
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК МеркурийПредприятия
	|	ПО
	|		МеркурийПредприятия.Ссылка = &ХозяйствующийСубъект И 
	|		МеркурийПредприятия.Предприятие = &Предприятие
	|	ГДЕ
	|		Организации.ИНН = &ИНН И 
	|		Организации.КПП = &КПП
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		Организации.Ссылка,
	|		ПодразделенияКомпании.Ссылка,
	|		4
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|	ПО
	|		Организации.Ссылка = ПодразделенияКомпании.Организация
	|	ГДЕ
	|		Организации.ИНН = &ИНН И 
	|		Организации.КПП = &КПП) КАК ВложеннаяТаблица
	|УПОРЯДОЧИТЬ ПО
	|	ВложеннаяТаблица.Приоритет
	|";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("Организация",   Выборка.Организация);
		Результат.Вставить("Подразделение", Выборка.ПодразделениеКомпании);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтрагента(ХозяйствующийСубъект) Экспорт
	
	Результат = Неопределено;
	Если НЕ ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХозяйствующиеСубъектыВЕТИС.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка = &ХозяйствующийСубъект И 
	|	ХозяйствующиеСубъектыВЕТИС.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН И 
	|	Контрагенты.КПП = &КПП И 
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("ИНН",                  ХозяйствующийСубъект.ИНН);
	Запрос.УстановитьПараметр("КПП",                  ХозяйствующийСубъект.КПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Контрагент;
	ИначеЕсли СокрЛП(ХозяйствующийСубъект.КПП) = "" Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН И 
		|	Контрагенты.ПометкаУдаления = ЛОЖЬ
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Контрагент;
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("КПП", "");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Результат = Выборка.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьХозСубъектПоКонтрагенту(Контрагент, ИНН = "", КПП = "", Запрашивать = Истина) Экспорт
	
	Результат = Неопределено;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъект,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.Контрагент = &Контрагент И 
	|	ХозяйствующиеСубъектыВЕТИС.ПометкаУдаления = ЛОЖЬ
	|" + ?(ИНН = "", "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка,
	|	2
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.ИНН = &ИНН И 
	|	ХозяйствующиеСубъектыВЕТИС.КПП = &КПП И 
	|	ХозяйствующиеСубъектыВЕТИС.ПометкаУдаления = ЛОЖЬ") + "
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ИНН",        ИНН);
	Запрос.УстановитьПараметр("КПП",        КПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ХозяйствующийСубъект;
	//ИначеЕсли СокрЛП(КПП) = "" Тогда
	//	Запрос.Текст = "
	//	|ВЫБРАТЬ
	//	|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъект
	//	|ИЗ
	//	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	//	|ГДЕ
	//	|	ХозяйствующиеСубъектыВЕТИС.ИНН = &ИНН И 
	//	|	ХозяйствующиеСубъектыВЕТИС.ПометкаУдаления = ЛОЖЬ
	//	|";
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Результат = Выборка.ХозяйствующийСубъект;
	//	КонецЕсли;
	//Иначе
	//	Запрос.УстановитьПараметр("КПП",        "");
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Количество() = 1 Тогда
	//		Выборка.Следующий();
	//		Результат = Выборка.ХозяйствующийСубъект;
	//	КонецЕсли;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Результат) И Запрашивать Тогда
	//	
	//	//Для Каждого ТекущаяСтрока Из ТранспортныеМодули Цикл
	//		
	//		//Если ТекущаяСтрока.Использование И ЗначениеЗаполнено(ТекущаяСтрока.ТранспортныйМодуль) Тогда
	//			//!!! Доделать
	//			//Смещение = 0;
	//			//Шаг      = 100;
	//			//Пока Шаг>0 Цикл
	//			//	
	//			//	РезультатЗапроса = ЗапросНаПолучениеСпискаХС(ТекущаяСтрока.ТранспортныйМодуль, Контрагент.ИНН, Смещение, Шаг);
	//			//	
	//			//	Для Каждого ТекущаяЗапись Из РезультатЗапроса.BusinessEntity Цикл
	//			//		СоздатьХозяйствующийСубъект(ТекущаяСтрока.ТранспортныйМодуль, ТекущаяЗапись);
	//			//	КонецЦикла;
	//			//	
	//			//	Смещение = Смещение + Шаг;
	//			//	Шаг      = Мин(100, РезультатЗапроса.total-Смещение);
	//			//КонецЦикла;
	//			//Прервать;
	//		//КонецЕсли;
	//		
	//	//КонецЦикла;
	//	
	//	// повторный поиск
	//	//Результат = ПолучитьХозСубъектПоКонтрагенту(Контрагент, Ложь);
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредприятия(ХозяйствующийСубъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Предприятия.Предприятие КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК Предприятия
	|ГДЕ
	|	Предприятия.Ссылка = &ХозяйствующийСубъект
	|";
	
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Предприятие");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиПредприятия(ХозяйствующийСубъект, Предприятие) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",      ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабПредприятия.Предприятие КАК Предприятие,
	|	ТабПредприятия.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ТабПредприятия.ОсновнойОтдел КАК ОсновнойОтдел
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ТабПредприятия
	|ГДЕ
	|	ТабПредприятия.Ссылка = &Ссылка И 
	|	ТабПредприятия.Предприятие = &Предприятие
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Предприятие",    Выборка.Предприятие);
		Результат.Вставить("ТорговыйОбъект", Выборка.ТорговыйОбъект);
		Результат.Вставить("ОсновнойОтдел",  Выборка.ОсновнойОтдел);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Код");
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	Если Объект.Собственный Тогда
		//ОбязательныеРеквизиты.Добавить("СпособХранения");
		//ОбязательныеРеквизиты.Добавить("НазначениеГруза");
		//ОбязательныеРеквизиты.Добавить("БлагополучиеМестности");
		//ОбязательныеРеквизиты.Добавить("СпособХранения");
		//ОбязательныеРеквизиты.Добавить("ТранспортноеСредство");
	КонецЕсли;
	
	// !__Раскомментировать, когда будет добавлен "МодульОбменаМеркурий".
	//глВнешнийМодульОбменаМеркурий.ХозяйствующиеСубъектыВЕТИСПолучитьОбязательныеРеквизиты(ЭтотОбъект, ОбязательныеРеквизиты, ДляЭлемента, ДляГруппы);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()




////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

	
#КонецЕсли
